In [13]:
'''
Debes escribir un programa que realice las siguientes tareas:

1. Importar los dos datasets adjuntos con la tarea y guardarlos en dos Dataframes. Analiza los datos.
2. Crea un DataFrame que incluya una columna con el coste mensual de Netflix, otra con el salario medio y otra con la mediana.
3. Normaliza los datos del DataFrame creado en el punto 3. Normalizar los datos consiste en escalar los valores para que tengan un rango similar. En este caso nos sirve para poder comparar el coste mensual de Netflix con el salario de una persona (que tendrán inicialmente un rango muy distinto). Hay muchos métodos para normalizar. En pandas tenemos algunos métodos que puedes encontrar en el enlace a continuación. Puedes usar uno o probar varios. Si haces esto último debes hacer varios métodos.

https://www.geeksforgeeks.org/normalize-a-column-in-pandas/

4. Finalmente debes pintar una gráfica con los datos por países ya normalizados y contestar a la pregunta. ¿Existe relación entre lo que gana una persona en cada país y lo que debe pagar por Netflix?

'''

import pandas as pd
import matplotlib as mat
import matplotlib.pyplot as mplt

df_netflix = pd.df = pd.read_csv("Netflix subscription fee Dec-2021.csv", sep=",") # Determinar con que caracteteres se separa el csv
df_salarios = pd.df = pd.read_csv("salaries_by_country_2021.csv")

In [14]:
df_netflix.head(5)

,Country_code,Country,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
0,ar,Argentina,4760,3154,1606,3.74,6.30,9.26
1,au,Australia,6114,4050,2064,7.84,12.12,16.39
2,at,Austria,5640,3779,1861,9.03,14.67,20.32
3,be,Belgium,4990,3374,1616,10.16,15.24,20.32
4,bo,Bolivia,4991,3155,1836,7.99,10.99,13.99

In [15]:
df_salarios.head(5)

                country  medianIncome  meanIncome  gdpPerCapitaPPP     pop2021
0            Luxembourg         26321       31376           124590     634.814
1  United Arab Emirates         24292       27017            70089    9991.089
2           Switzerland         21490       25787            72376    8715.494
3         United States         19306       25332            65297  332915.073
4                Norway         22684       25272            70005    5465.630

In [16]:
df_unido = df_salarios.merge(df_netflix, how = "inner", right_on = "Country", left_on = "country")

df_unido.head()

,country,medianIncome,meanIncome,gdpPerCapitaPPP,pop2021,Country_code,Country,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
0,Switzerland,21490,25787,72376,8715.494,ch,Switzerland,5506,3654,1852,12.88,20.46,26.96
1,United States,19306,25332,65297,332915.073,us,United States,5818,3826,1992,8.99,13.99,17.99
2,Norway,22684,25272,70005,5465.630,no,Norway,4528,2955,1573,9.94,12.17,17.75
3,Canada,18652,22042,51668,38067.903,ca,Canada,6239,4311,1928,7.91,11.87,15.03
4,Australia,17076,21329,53381,25788.215,au,Australia,6114,4050,2064,7.84,12.12,16.39

In [ ]:
# 2. Crea un DataFrame que incluya una columna con el coste mensual de Netflix, otra con el salario medio y otra con la mediana.

df_unido = df_unido[["Cost Per Month - Standard ($)", "meanIncome", "medianIncome"]]



df_unido.head()

   Cost Per Month - Standard ($)  meanIncome  medianIncome
0                          20.46       25787         21490
1                          13.99       25332         19306
2                          12.17       25272         22684
3                          11.87       22042         18652
4                          12.12       21329         17076

In [ ]:
#3. Normaliza los datos del DataFrame creado en el punto 3. Normalizar los datos consiste en escalar los valores para que tengan un rango similar. 
# En este caso nos sirve para poder comparar el coste mensual de Netflix con el salario de una persona (que tendrán inicialmente un rango muy distinto). Hay muchos métodos para normalizar. En pandas tenemos algunos métodos que puedes encontrar en el enlace a continuación. Puedes usar uno o probar varios. Si haces esto último debes hacer varios métodos.

from sklearn.preprocessing import MinMaxScaler 
escalador = MinMaxScaler()
df_unido[['Cost Per Month - Standard ($)', 'meanIncome', 'medianIncome']] = escalador.fit_transform(df_unido[['Cost Per Month - Standard ($)', 'meanIncome', 'medianIncome']])
df_unido.head()

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (4027848938.py, line 6)